#ifndef _ANIMCAM_H_
#define _ANIMCAM_H_

#include "Game/Camera/BaseCamera.h"
#include "Game/SAnim.h"
#include "NL/nlList.h"
#include "NL/nlString.h"

class cCameraData
{
public:
    ~cCameraData()
    {
        if (ownsKeyData)
        {
            delete[] cameraPos;
            delete[] targetPos;
            delete[] cameraRot;
            delete[] fFOV;
            delete[] fFocalLength;
        }
    }

    /*  0x00 */ cCameraData* next;
    /*  0x04 */ unsigned long m_uHashID;
    /*  0x08 */ unsigned long m_uKeyCount;
    /*  0x0C */ nlVector3* cameraPos;
    /*  0x10 */ nlVector3* targetPos;
    /*  0x14 */ nlQuaternion* cameraRot;
    /*  0x18 */ float* fFOV;
    /*  0x1C */ float* fFocalLength;
    /*  0x20 */ bool ownsKeyData;
}; // total size: 0x24

bool LoadAnimCameraData(nlChunk*, nlChunk*, cCameraData*, bool);
void EnableDofDebug();

class cAnimCamera : public cBaseCamera
{
public:
    cAnimCamera();
    /* 0x08 */ virtual ~cAnimCamera();
    /* 0x0C */ virtual eCameraType GetType() { return eCameraType_Animated; };
    /* 0x14 */ virtual const nlMatrix4& GetViewMatrix() const { return m_matView; };
    /* 0x18 */ virtual float GetFOV() const { return m_Fov; };
    /* 0x20 */ virtual const nlVector3& GetCameraPosition() const { return m_vecCamera; };
    /* 0x24 */ virtual const nlVector3& GetTargetPosition() const { return m_vecTarget; };

    bool LoadCameraAnimation(nlChunk*, nlChunk*, const char*, bool);
    static bool LoadCameraAnimation(const char*, const char*, bool);
    static void FreeCameraAnimations();

    void BuildAnimViewMatrix(nlMatrix4&);
    void UnselectCameraAnimation();
    void SelectCameraAnimation(const char*);
    bool CameraAnimationExists(const char*) const;
    static void FreeCameraAnimation(const char*);
    void Update(float);
    void ManualUpdate(float);

    static cCameraData* m_cameraDataList;

    /* 0x1C */ bool m_bCyclic;
    /* 0x1D */ bool m_bUseSimulationTime;
    /* 0x1E */ bool m_LetManagerDoUpdate;
    /* 0x20 */ nlMatrix4 m_matView;
    /* 0x60 */ nlVector3 m_vecCamera;
    /* 0x6C */ nlVector3 m_vecTarget;
    /* 0x78 */ float m_fAnimationTime;
    /* 0x7C */ float m_fAnimationSpeed;
    /* 0x80 */ float m_fLastSimulationTime;
    /* 0x84 */ cCameraData* m_pActiveCameraData;
    /* 0x88 */ nlVector3 m_OffsetPos;
    /* 0x94 */ nlVector3 m_Mirror;
    /* 0xA0 */ unsigned short mFacingAngle;
    /* 0xA4 */ float m_Fov;
    /* 0xA8 */ void (*m_EndOfAnimationCallback)();
}; // total size: 0xAC

#endif // _ANIMCAM_H_
