#include "Game/Audio/CrowdMood.h"
#include "Game/Audio/WorldAudio.h"
#include "Game/AI/AiUtil.h"
#include "Game/Game.h"
#include "Game/Sys/GCStream.h"

#include "NL/nlConfig.h"
#include "NL/nlMath.h"
#include "NL/nlString.h"

extern void ___blank(const char*, ...);
extern "C" void sndStreamMixParameterEx(unsigned long stid, unsigned char vol, unsigned char pan, unsigned char span, unsigned char auxa, unsigned char auxb);
extern "C" void sndStreamLPFParameter(unsigned long, unsigned long, unsigned long);
extern "C" void sndStreamDeactivate(unsigned long stid);

struct CROWD_SETTINGS
{
    /* 0x000 */ float MoodDecayDelay;
    /* 0x004 */ float MoodDecayRate;
    /* 0x008 */ float BlendSpeedNormal;
    /* 0x00C */ float BlendSpeedFast;
    /* 0x010 */ float BlendStrictness;
    /* 0x014 */ float CrowdMasterVolume;
    /* 0x018 */ char NeutralSampleName[256];
    /* 0x118 */ char NegativeSampleName[256];
    /* 0x218 */ char PositiveSampleName[256];
    /* 0x318 */ char SaturationSampleNames[5][256];
    /* 0x818 */ unsigned char NoStreaming : 1;
}; // total size: 0x81C

static bool g_Initd;

template <typename T>
void Increment(T& Value);

static bool g_DoDecay = true;
static bool g_CrowdSFXStopped;
static CROWD_SETTINGS g_Settings;

CROWD_AUDIO_INIT g_CrowdAudio;
CROWD_STATE g_CrowdState;

// /**
//  * Offset/Address/Size: 0x134 | 0x801514D0 | size: 0x2C
//  */
// void GCAudioStreaming::MonoAudioStream::Purge()
// {
// }

// /**
//  * Offset/Address/Size: 0x108 | 0x801514A4 | size: 0x2C
//  */
// void GCAudioStreaming::StereoAudioStream::Purge()
// {
// }

// /**
//  * Offset/Address/Size: 0x98 | 0x80151434 | size: 0x70
//  */
// void GCAudioStreaming::MonoAudioStream::~MonoAudioStream()
// {
// }

// /**
//  * Offset/Address/Size: 0x4C | 0x801513E8 | size: 0x4C
//  */
// void GCAudioStreaming::StereoAudioStream::SafeToPurge()
// {
// }

// /**
//  * Offset/Address/Size: 0x0 | 0x8015139C | size: 0x4C
//  */
// void GCAudioStreaming::MonoAudioStream::SafeToPurge()
// {
// }

