#ifndef _GCMEMCARD_H_
#define _GCMEMCARD_H_

// #include "Game/DB/SaveLoad.h"
#include <dolphin/card.h>
#include "NL/nlSortedSlot.h"

enum INTERNAL_STATE
{
    IS_IDLE = 0,
    IS_ERROR = 1,
    IS_MOUNTING = 2,
    IS_CARDCHECK = 3,
    IS_MOUNTED = 4,
    IS_MOUNTED_ERROR = 5,
    IS_FORMATTING = 6,
    IS_CREATING = 7,
    IS_DELETING = 8,
    IS_READING = 9,
    IS_WRITING = 10,
    IS_WRITINGSTATUS = 11,
};

enum CARD_STATE
{
    CS_IDLE = 0,
    CS_MOUNTING = 1,
    CS_MOUNTED = 2,
    CS_MOUNTED_ERROR = 3,
    CS_FORMATTING = 4,
    CS_CREATING = 5,
    CS_DELETING = 6,
    CS_READING = 7,
    CS_WRITING = 8,
    CS_END = 9,
};

struct CARD_INFO
{
    /* 0x0 */ long CardSize;
    /* 0x4 */ long SectorSize;
    /* 0x8 */ long FreeBytes;
    /* 0xC */ long FreeFiles;
}; // total size: 0x10

class MemCardFunctor
{
public:
    MemCardFunctor() { }

    class MCInternalFunctorBase
    {
    public:
        MCInternalFunctorBase()
            : m_pData(NULL)
        {
        }
        ~MCInternalFunctorBase();
        virtual void Call(unsigned long, long);
        virtual void Destroy();

        /* 0x04 */ void* m_pData;
    };

    template <class T>
    class MCMemberFunctor : public MCInternalFunctorBase
    {
    public:
        typedef void (T::*MemberCB)(unsigned long, long, void*);

        MCMemberFunctor(T* obj, const MemberCB& cb)
        {
            m_pFunc = ((void**)&cb)[0];
            m_Slot = ((unsigned long*)&cb)[1];
            m_pfnCB = ((void**)&cb)[2];
            m_pObject = obj;
        }
        ~MCMemberFunctor();
        virtual void Call(unsigned long, long);
        virtual void Destroy();

        /* 0x08 */ void* m_pFunc;
        /* 0x0C */ unsigned long m_Slot;
        /* 0x10 */ void* m_pfnCB;
        /* 0x14 */ T* m_pObject;
    };

    /* 0x00 */ unsigned char m_FunctorMem[24];
}; // total size: 0x18

class MemCard
{
public:
    struct ICON_DATA_INFO
    {
        /* 0x00 */ unsigned short Comment1Offset;
        /* 0x02 */ unsigned short Comment2Offset;
        /* 0x04 */ unsigned short BannerOffset;
        /* 0x06 */ unsigned short BannerCLUTOffset;
        /* 0x08 */ unsigned long IconOffset[8];
        /* 0x28 */ unsigned long IconCLUTOffset;
        /* 0x2C */ unsigned char* pHeaderData;
    }; // total size: 0x30

    struct ICON_CONFIG
    {
        void GetValidDataInfo(ICON_DATA_INFO&) const;

        /* 0x0 */ unsigned char BannerFormat;
        /* 0x1 */ unsigned char IconCount;
        /* 0x2 */ char IconFormat;
        /* 0x3 */ char IconAnimType;
        /* 0x4 */ char IconSpeeds[8];
        /* 0xC */ unsigned long HeaderSize;
    }; // total size: 0x10

    struct MC_FILE
    {
        /* 0x00 */ CARDFileInfo FileInfo;
        /* 0x14 */ ICON_CONFIG IconCfg;
        /* 0x24 */ unsigned long TotalHeaderSize;
    }; // total size: 0x28

    static void CardRemovedCB(long channel, long result);
    static void MountDoneCB(long channel, long result);
    static void CreateFileDoneCB(long channel, long result);
    static void FormatDoneCB(long channel, long result);
    static void DeleteFileDoneCB(long channel, long result);
    static void ReadFileDoneCB(long channel, long result);
    static void SetStatusDoneCB(long channel, long result);
    static void CardCheckBrokenDoneCB(long channel, long result);
    static void CardCheckDoneCB(long channel, long result);
    static void WriteFileDoneCB(long channel, long result);

    long BeginCardAccess(const MemCardFunctor&);
    void CreateFile(const char*, unsigned long, MemCard::ICON_CONFIG*, MemCard::MC_FILE*&, const MemCardFunctor&);
    void OpenFile(const char*, MemCard::MC_FILE*&, unsigned long*);
    long FormatCard(const MemCardFunctor&);
    void DeleteFile(const char*, const MemCardFunctor&);
    long InternalReadFile(MemCard::MC_FILE*, void*, unsigned long, unsigned long, const MemCardFunctor&);
    long InternalWriteFile(MemCard::MC_FILE*, void*, unsigned long, unsigned long, const MemCardFunctor&, bool);
    long CloseFile(MemCard::MC_FILE*);
    long FileExists(const char*);
    void WriteFileIconData(MemCard::MC_FILE*, void*, const MemCardFunctor&);
    unsigned long AlignBytesToSectorSize(unsigned long);

    s64 GetSerialID() const;

    /* 0x000  */ INTERNAL_STATE m_State;
    /* 0x004  */ unsigned long m_Slot;
    /* 0x008  */ CARD_STATE m_CardState;
    /* 0x00C  */ CARD_INFO m_CardInfo;
    /* 0x01C */ unsigned long m_LastTransferSize;
    /* 0x020 */ unsigned long m_TargetTransferSize;
    /* 0x024 */ s32 unk_24;
    /* 0x028 */ s64 m_SerialID;
    /* 0x030 */ MemCardFunctor m_CB[9];
    /* 0x108 */ nlStaticSortedSlot<MC_FILE, 16> m_OpenFiles;
    /* 0x41C */ MC_FILE* m_pFileCB;
    /* 0x420 */ void* m_pDataCB;
    /* 0x424 */ unsigned long m_GameId;
    /* 0x428 */ unsigned short m_CompanyId;
    /* 0x42A */ unsigned char m_CardWorkArea[41472];

    static bool s_InitDone;
}; // total size: 0xA620

extern MemCard** g_MemCards;

// class nlBSearch < nlSortedSlot < MemCard
// {
// public:
//     void MC_FILE, 16 > ::EntryLookup<MemCard::MC_FILE>, unsigned long > (const unsigned long&, nlSortedSlot<MemCard::MC_FILE, 16>::EntryLookup<MemCard::MC_FILE>*, int);
// };

// class nlStaticSortedSlot < MemCard
// {
// public:
//     void MC_FILE, 16 > ::GetNewEntry();
//     void MC_FILE, 16 > ::FreeEntry(MemCard::MC_FILE*);
//     void MC_FILE, 16 > ::FreeLookup();
//     void MC_FILE, 16 > ::ExpandLookup();
// };

#endif // _GCMEMCARD_H_
