#ifndef _RENDERSHADOW_H_
#define _RENDERSHADOW_H_

#include "types.h"
#include "NL/nlMath.h"
#include "NL/nlPrint.h"
#include "NL/gl/gl.h"
#include "NL/gl/glConstant.h"
#include "NL/gl/glState.h"
#include "NL/gl/glMatrix.h"

struct ProjectedShadowParams
{
    nlVector4 vLight;       // 0x00, size 0x10
    nlVector3 vPosition;    // 0x10, size 0xC
    float fRadius;          // 0x1C, size 0x4
    struct glModel* pModel; // 0x20, size 0x4
    float fWidth;           // 0x24, size 0x4
    float fHeight;          // 0x28, size 0x4
    float fScalar;          // 0x2C, size 0x4
    int nPartitionIndex;    // 0x30, size 0x4
    int nVisibleInterval;   // 0x34, size 0x4
    int nInvisibleInterval; // 0x38, size 0x4
};

class nlColour;
class glQuad3;
class glModel;

void RenderProjectedShadow(const ProjectedShadowParams&);
void RenderBlobShadow(const nlVector3&, const nlVector3*, int, const int*, const nlColour*);
void SubdivideAndRender(glQuad3&, eGLView);
void SetCharacterShadowUpdated(int, bool);
void RenderCharacterIntoTexture(const ProjectedShadowParams&);
u8 ShouldShadowBeUpdated(const ProjectedShadowParams&);
void GetShadowPartitionIndex();
void RenderShadowModel(unsigned long, glModel*, unsigned long);
void ShadowStartup();

extern int MaxProjectedShadows;

#endif // _RENDERSHADOW_H_
