#include "Game/Transitions/ScriptedTransition.h"

#include "stdlib.h"
#include "strtold.h"

#include "NL/gl/glState.h"
#include "NL/gl/glStruct.h"
#include "NL/nlString.h"

inline float parseFloat(const char* str, float defaultValue = 0.0f)
{
    if (str != nullptr)
    {
        return atof(str);
    }
    return defaultValue;
}

namespace TransitionModifiers
{

class ScaleModel : public TransitionModifierInterface
{
public:
    ScaleModel()
    {
        m_v2StartScale.f.x = 1.0f;
        m_v2StartScale.f.y = 1.0f;
        m_v2EndScale.f.x = 1.0f;
        m_v2EndScale.f.y = 1.0f;
    }

    virtual ~ScaleModel() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        m_v2StartScale.f.x = atof(parser->NextTokenOnLine(true));
        m_v2StartScale.f.y = atof(parser->NextTokenOnLine(true));
        f32 val = m_v2StartScale.f.x;
        char* token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndScale.f.x = val;

        val = m_v2StartScale.f.y;
        token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndScale.f.y = val;
    }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        float x = ((1.0f - time) * m_v2StartScale.f.x) + (time * m_v2EndScale.f.x);
        float y = ((1.0f - time) * m_v2StartScale.f.y) + (time * m_v2EndScale.f.y);

        poly.m_pos[0].f.x *= x;
        poly.m_pos[0].f.y *= y;
        poly.m_pos[1].f.x *= x;
        poly.m_pos[1].f.y *= y;
        poly.m_pos[2].f.x *= x;
        poly.m_pos[2].f.y *= y;
        poly.m_pos[3].f.x *= x;
        poly.m_pos[3].f.y *= y;
    }

    /* 0x4 */ nlVector2 m_v2StartScale;
    /* 0xC */ nlVector2 m_v2EndScale;
}; // total size: 0x14

class ColourBlend : public TransitionModifierInterface
{
public:
    ColourBlend()
    {
        nlColourSet(m_cStartColour, 0xFF, 0xFF, 0xFF, 0xFF);
        nlColourSet(m_cEndColour, 0xFF, 0xFF, 0xFF, 0xFF);
    }

    virtual ~ColourBlend() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        m_cStartColour.c[0] = atoi(parser->NextTokenOnLine(true));
        m_cStartColour.c[1] = atoi(parser->NextTokenOnLine(true));
        m_cStartColour.c[2] = atoi(parser->NextTokenOnLine(true));
        m_cStartColour.c[3] = atoi(parser->NextTokenOnLine(true));

        unsigned char val = m_cStartColour.c[0];
        char* token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atoi(token);
        }
        m_cEndColour.c[0] = val;

        val = m_cStartColour.c[1];
        token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atoi(token);
        }
        m_cEndColour.c[1] = val;

        val = m_cStartColour.c[2];
        token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atoi(token);
        }
        m_cEndColour.c[2] = val;

        val = m_cStartColour.c[3];
        token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atoi(token);
        }
        m_cEndColour.c[3] = val;
    }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        nlColour col;
        s32 temp_r6;
        u32 temp_r3;

        temp_r3 = 255.0f * time;
        temp_r6 = 0xFF - temp_r3;

        col.c[0] = ((temp_r6 * m_cStartColour.c[0]) + (temp_r3 * m_cEndColour.c[0])) >> 8;
        col.c[1] = ((temp_r6 * m_cStartColour.c[1]) + (temp_r3 * m_cEndColour.c[1])) >> 8;
        col.c[2] = ((temp_r6 * m_cStartColour.c[2]) + (temp_r3 * m_cEndColour.c[2])) >> 8;
        col.c[3] = ((temp_r6 * m_cStartColour.c[3]) + (temp_r3 * m_cEndColour.c[3])) >> 8;
        poly.SetColour(col);
    }

    /* 0x4 */ nlColour m_cStartColour;
    /* 0x8 */ nlColour m_cEndColour;
}; // total size: 0xC

class ScaleTexture : public TransitionModifierInterface
{
public:
    ScaleTexture()
    {
        m_v2StartShift.f.x = 1.0f;
        m_v2StartShift.f.y = 1.0f;
        m_v2EndShift.f.x = 1.0f;
        m_v2EndShift.f.y = 1.0f;
    }

    virtual ~ScaleTexture() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        m_v2StartShift.f.x = atof(parser->NextTokenOnLine(true));
        m_v2StartShift.f.y = atof(parser->NextTokenOnLine(true));
        f32 val = m_v2StartShift.f.x;
        char* token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndShift.f.x = val;

        val = m_v2StartShift.f.y;
        token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndShift.f.y = val;
    }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        float x = ((1.0f - time) * m_v2StartShift.f.x) + (time * m_v2EndShift.f.x);
        float y = ((1.0f - time) * m_v2StartShift.f.y) + (time * m_v2EndShift.f.y);

        poly.m_uv[0].f.x *= x;
        poly.m_uv[0].f.y *= y;
        poly.m_uv[1].f.x *= x;
        poly.m_uv[1].f.y *= y;
        poly.m_uv[2].f.x *= x;
        poly.m_uv[2].f.y *= y;
        poly.m_uv[3].f.x *= x;
        poly.m_uv[3].f.y *= y;
    }

    /* 0x4 */ nlVector2 m_v2StartShift;
    /* 0xC */ nlVector2 m_v2EndShift;
}; // total size: 0x14

class TranslateModel : public TransitionModifierInterface
{
public:
    TranslateModel()
    {
        m_v2StartShift.f.x = 0.0f;
        m_v2StartShift.f.y = 0.0f;
        m_v2EndShift.f.x = 0.0f;
        m_v2EndShift.f.y = 0.0f;
    }

    virtual ~TranslateModel() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        m_v2StartShift.f.x = atof(parser->NextTokenOnLine(true));
        m_v2StartShift.f.y = atof(parser->NextTokenOnLine(true));
        f32 val = m_v2StartShift.f.x;
        char* token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndShift.f.x = val;

        val = m_v2StartShift.f.y;
        token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndShift.f.y = val;
    }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        float x = ((1.0f - time) * m_v2StartShift.f.x) + (time * m_v2EndShift.f.x);
        float y = ((1.0f - time) * m_v2StartShift.f.y) + (time * m_v2EndShift.f.y);

        poly.m_pos[0].f.x += x;
        poly.m_pos[0].f.y += y;
        poly.m_pos[1].f.x += x;
        poly.m_pos[1].f.y += y;
        poly.m_pos[2].f.x += x;
        poly.m_pos[2].f.y += y;
        poly.m_pos[3].f.x += x;
        poly.m_pos[3].f.y += y;
    }

    /* 0x4 */ nlVector2 m_v2StartShift;
    /* 0xC */ nlVector2 m_v2EndShift;
}; // total size: 0x14

class TranslateTexture : public TransitionModifierInterface
{
public:
    TranslateTexture()
    {
        m_v2StartShift.f.x = 0.0f;
        m_v2StartShift.f.y = 0.0f;
        m_v2EndShift.f.x = 0.0f;
        m_v2EndShift.f.y = 0.0f;
    }

    virtual ~TranslateTexture() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        m_v2StartShift.f.x = atof(parser->NextTokenOnLine(true));
        m_v2StartShift.f.y = atof(parser->NextTokenOnLine(true));
        f32 val = m_v2StartShift.f.x;
        char* token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndShift.f.x = val;

        val = m_v2StartShift.f.y;
        token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            val = atof(token);
        }
        m_v2EndShift.f.y = val;
    }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        float x = ((1.0f - time) * m_v2StartShift.f.x) + (time * m_v2EndShift.f.x);
        float y = ((1.0f - time) * m_v2StartShift.f.y) + (time * m_v2EndShift.f.y);

        poly.m_uv[0].f.x += x;
        poly.m_uv[0].f.y += y;
        poly.m_uv[1].f.x += x;
        poly.m_uv[1].f.y += y;
        poly.m_uv[2].f.x += x;
        poly.m_uv[2].f.y += y;
        poly.m_uv[3].f.x += x;
        poly.m_uv[3].f.y += y;
    }

    /* 0x04 */ nlVector2 m_v2StartShift;
    /* 0x0C */ nlVector2 m_v2EndShift;
}; // total size: 0x14

class RotateModel : public TransitionModifierInterface
{
public:
    RotateModel()
    {
        m_angleStart = 0.0f;
        m_angleEnd = 0.0f;
        m_v3Axis.f.x = 0.0f;
        m_v3Axis.f.y = 0.0f;
        m_v3Axis.f.z = 1.0f;
    }

    virtual ~RotateModel() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        f32 angleEnd;

        m_v3Axis.f.x = atof(parser->NextTokenOnLine(true));
        m_v3Axis.f.y = atof(parser->NextTokenOnLine(true));
        m_v3Axis.f.z = atof(parser->NextTokenOnLine(true));
        m_angleStart = atof(parser->NextTokenOnLine(true));

        angleEnd = m_angleStart;
        char* token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            angleEnd = atof(token);
        }
        m_angleEnd = angleEnd;
    }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        nlMatrix4 m4;
        nlMatrix3 m3;
        nlQuaternion quat;

        nlMakeQuat(quat, m_v3Axis, (3.1415927f * ((m_angleStart * (1.0f - time)) + (time * m_angleEnd))) / 180.0f);
        nlQuatToMatrix(m4, quat);

        m3.m[0] = m4.f.m11;
        m3.m[1] = m4.f.m12;
        m3.m[3] = m4.f.m21;
        m3.m[4] = m4.f.m22;
        m3.m[7] = 0.0f;
        m3.m[6] = 0.0f;
        m3.m[5] = 0.0f;
        m3.m[2] = 0.0f;
        m3.m[8] = 1.0f;

        for (int i = 0; i < 4; i++)
        {
            nlVector2 temp;
            nlMultVectorMatrix(temp, poly.m_pos[i], m3);
            poly.m_pos[i] = temp;
        }
    }

    /* 0x04 */ nlVector3 m_v3Axis;
    /* 0x10 */ float m_angleStart;
    /* 0x14 */ float m_angleEnd;
}; // total size: 0x18

class RotateTexture : public TransitionModifierInterface
{
public:
    RotateTexture()
    {
        m_angleStart = 0.0f;
        m_angleEnd = 0.0f;
        m_v3Axis.f.x = 0.0f;
        m_v3Axis.f.y = 0.0f;
        m_v3Axis.f.z = 1.0f;
    }

    virtual ~RotateTexture() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        f32 angleEnd;

        m_v3Axis.f.x = atof(parser->NextTokenOnLine(true));
        m_v3Axis.f.y = atof(parser->NextTokenOnLine(true));
        m_v3Axis.f.z = atof(parser->NextTokenOnLine(true));
        m_angleStart = atof(parser->NextTokenOnLine(true));

        angleEnd = m_angleStart;
        char* token = parser->NextTokenOnLine(true);
        if (token != nullptr)
        {
            angleEnd = atof(token);
        }
        m_angleEnd = angleEnd;
    }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        nlMatrix4 m4;
        nlMatrix3 m3;
        nlQuaternion quat;

        nlMakeQuat(quat, m_v3Axis, (3.1415927f * ((m_angleStart * (1.0f - time)) + (time * m_angleEnd))) / 180.0f);
        nlQuatToMatrix(m4, quat);

        m3.m[0] = m4.f.m11;
        m3.m[1] = m4.f.m12;
        m3.m[3] = m4.f.m21;
        m3.m[4] = m4.f.m22;
        m3.m[7] = 0.0f;
        m3.m[6] = 0.0f;
        m3.m[5] = 0.0f;
        m3.m[2] = 0.0f;
        m3.m[8] = 1.0f;

        for (int i = 0; i < 4; i++)
        {
            nlVector2 temp;
            nlMultVectorMatrix(temp, poly.m_pos[i], m3);
            poly.m_uv[i] = temp;
        }
    }

    /* 0x04 */ nlVector3 m_v3Axis;
    /* 0x10 */ float m_angleStart;
    /* 0x14 */ float m_angleEnd;
}; // total size: 0x18

class ScreenBlur : public TransitionModifierInterface
{
public:
    ScreenBlur()
    {
        m_fStartBlend = 1.0f;
        m_fEndBlend = 1.0f;
    }

    virtual ~ScreenBlur() { }

    virtual void InitializeFromParser(SimpleParser* parser)
    {
        m_fStartBlend = parseFloat(parser->NextTokenOnLine(true), 1.0f);
        m_fEndBlend = parseFloat(parser->NextTokenOnLine(true), 1.0f);
    }

    virtual void ApplyModifier(glPoly2& poly, float time) { }

    virtual void Cleanup()
    {
        glViewSetFilter(GLV_ScreenBlur, GLFilter_None);
        glViewSetFilterSource(GLV_ScreenBlur, GLTG_Main);
        glViewSetFilter(GLV_ScreenBlur2, GLFilter_None);
        glViewSetFilterSource(GLV_ScreenBlur2, GLTG_GlowConv);
    }

    /* 0x4 */ float m_fStartBlend;
    /* 0x8 */ float m_fEndBlend;
}; // total size: 0xC

class ScreenGrab : public TransitionModifierInterface
{
public:
    ScreenGrab()
    {
        m_bDoGrab = true;
        m_nTexture = glHash("target/backbuffer");
    }

    virtual ~ScreenGrab() { }

    virtual void InitializeFromParser(SimpleParser* parser) { }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        if (m_bDoGrab)
        {
            glViewSetFilter(GLV_ScreenGrab, GLFilter_Blt);
            glViewSetFilterSource(GLV_ScreenGrab, GLTG_Main);
            m_bDoGrab = false;
        }
        else
        {
            glViewSetFilter(GLV_ScreenGrab, GLFilter_None);
        }
    }

    virtual void Cleanup()
    {
        glViewSetFilter(GLV_ScreenGrab, GLFilter_None);
        m_bDoGrab = true;
    }

    /* 0x4 */ bool m_bDoGrab;
    /* 0x8 */ u32 m_nTexture;
}; // total size: 0xC

class ToScreenCoordinates : public TransitionModifierInterface
{
public:
    ToScreenCoordinates()
    {
        float temp_f30 = 0.5f * glGetOrthographicWidth();
        float temp_f31 = 0.5f * glGetOrthographicHeight();
        float temp_f1 = -glGetScreenInfo()->PixelCentre;

        m_m3Position.SetIdentity();
        m_m3UV.SetIdentity();

        m_m3Position.f.m11 = temp_f30;
        m_m3Position.f.m22 = temp_f31;
        m_m3Position.f.m31 = temp_f30 - temp_f1;
        m_m3Position.f.m32 = temp_f31 - temp_f1;

        m_m3UV.f.m32 = 0.5f;
        m_m3UV.f.m31 = 0.5f;
        m_m3UV.f.m22 = 0.5f;
        m_m3UV.f.m11 = 0.5f;
    };

    virtual ~ToScreenCoordinates() { }

    virtual void InitializeFromParser(SimpleParser* parser) { }

    virtual void ApplyModifier(glPoly2& poly, float time)
    {
        for (int i = 0; i < 4; i++)
        {
            nlVector2 temp;
            nlMultVectorMatrix(temp, poly.m_pos[i], m_m3Position);
            poly.m_pos[i] = temp;

            nlMultVectorMatrix(temp, poly.m_uv[i], m_m3UV);
            poly.m_uv[i] = temp;
        }
    }

    /* 0x04 */ nlMatrix3 m_m3Position;
    /* 0x28 */ nlMatrix3 m_m3UV;
}; // total size: 0x4C

}; // namespace TransitionModifiers

/**
 * Offset/Address/Size: 0x9A0 | 0x802072CC | size: 0x74
 */
ScriptedScreenTransition::ScriptedScreenTransition()
{
    m_pModifiers = nullptr;
    m_nModifiers = 0;
    m_fLength = 0.0f;
    m_fCurrentTime = 0.0f;
    m_nTexture = glHash("global/white");
    m_eTimeLine = TIME_LINEAR;
}

/**
 * Offset/Address/Size: 0x8D0 | 0x802071FC | size: 0xD0
 */
ScriptedScreenTransition::~ScriptedScreenTransition()
{
    if (m_pModifiers != nullptr)
    {
        for (int i = 0; i < m_nModifiers; i++)
        {
            delete m_pModifiers[i];
            m_pModifiers[i] = nullptr;
        }

        delete[] m_pModifiers;
        m_pModifiers = nullptr;
    }
}

/**
 * Offset/Address/Size: 0x8C0 | 0x802071EC | size: 0x10
 */
void ScriptedScreenTransition::Update(float dt)
{
    m_fCurrentTime += dt;
}

/**
 * Offset/Address/Size: 0x708 | 0x80207034 | size: 0x1B8
 */
void ScriptedScreenTransition::Render(eGLView view)
{
    glPoly2 poly;                                 // r1+0xC
    nlColour colour = { 0xFF, 0xFF, 0xFF, 0xFF }; // r1+0x8

    nlVec2Set(poly.m_pos[0], -1.0f, -1.0f);
    nlVec2Set(poly.m_pos[1], -1.0f, 1.0f);
    nlVec2Set(poly.m_pos[2], 1.0f, 1.0f);
    nlVec2Set(poly.m_pos[3], 1.0f, -1.0f);

    poly.depth = -1.0f;

    nlVec2Set(poly.m_uv[0], -1.0f, -1.0f);
    nlVec2Set(poly.m_uv[1], -1.0f, 1.0f);
    nlVec2Set(poly.m_uv[2], 1.0f, 1.0f);
    nlVec2Set(poly.m_uv[3], 1.0f, -1.0f);

    *(u32*)&poly.m_colour[0] = *(u32*)&colour; // sp4C (0x4C) -> offset 0x40
    *(u32*)&poly.m_colour[1] = *(u32*)&colour; // sp50 (0x50) -> offset 0x44
    *(u32*)&poly.m_colour[2] = *(u32*)&colour; // sp54 (0x54) -> offset 0x48
    *(u32*)&poly.m_colour[3] = *(u32*)&colour; // sp58 (0x58) -> offset 0x4C

    // *(u32*)&colour = 0xFFFFFFFF;
    float normalizedTime;
    if (m_fLength > 0.00001) // @532 = 0.0f
    {
        normalizedTime = m_fCurrentTime / m_fLength;
    }
    else
    {
        normalizedTime = 0.0f; // @333 = 0.0f
    }

    float finalTime;
    switch (m_eTimeLine)
    {
    case TIME_ACCEL:
        finalTime = normalizedTime * normalizedTime;
        break;
    case TIME_DECEL:
        finalTime = nlSqrt(normalizedTime, true);
        break;
    case TIME_LINEAR:
        finalTime = normalizedTime;
        break;
    default:
        finalTime = normalizedTime;
        break;
    }

    glSetDefaultState(false);
    glSetCurrentTexture(m_nTexture, GLTT_Diffuse);
    glSetTextureState(GLTS_DiffuseWrap, 3);
    glSetRasterState(GLS_AlphaBlend, 1);

    for (int i = 0; i < m_nModifiers; i++)
    {
        m_pModifiers[i]->ApplyModifier(poly, finalTime);
    }

    glSetCurrentRasterState(glHandleizeRasterState());
    glSetCurrentTextureState(glHandleizeTextureState());
    poly.Attach(view, 0, nullptr, 0xFFFFFFFF);
}

/**
 * Offset/Address/Size: 0x698 | 0x80206FC4 | size: 0x70
 */
void ScriptedScreenTransition::Cancel()
{
    for (int i = 0; i < m_nModifiers; i++)
    {
        m_pModifiers[i]->Cleanup();
    }
}

/**
 * Offset/Address/Size: 0x3B8 | 0x80206CE4 | size: 0x2E0
 */
void ScriptedScreenTransition::InitializeFromParser(SimpleParser* parser)
{
    TransitionModifierInterface* pModifiers[25]; // r1+0x8
    m_nModifiers = 0;

    for (char* pToken = parser->NextToken(true); pToken != nullptr; pToken = parser->NextToken(true))
    {
        if (nlStrCmp<char>(pToken, "end") == 0)
            break;

        if (nlStrCmp<char>(pToken, "length") == 0)
        {
            m_fLength = atof(parser->NextTokenOnLine(true));
        }
        else if (nlStrCmp<char>(pToken, "texture") == 0)
        {
            m_nTexture = glHash(parser->NextTokenOnLine(true));
        }
        else if (nlStrCmp<char>(pToken, "time") == 0)
        {
            char* temp_r3 = parser->NextTokenOnLine(true);
            if (nlStrCmp<char>(temp_r3, "linear") == 0)
            {
                m_eTimeLine = TIME_LINEAR;
            }
            else if (nlStrCmp<char>(temp_r3, "accelerate") == 0)
            {
                m_eTimeLine = TIME_ACCEL;
            }
            else if (nlStrCmp<char>(temp_r3, "decelarate") == 0)
            {
                m_eTimeLine = TIME_DECEL;
            }
        }
        else
        {
            TransitionModifierInterface* pModifier = GetModifierFromName(pToken);
            pModifier->InitializeFromParser(parser);
            pModifiers[m_nModifiers] = pModifier;
            m_nModifiers += 1;
        }
    }

    pModifiers[m_nModifiers] = new (nlMalloc(0x4C, 8, false)) TransitionModifiers::ToScreenCoordinates();
    m_nModifiers += 1;

    m_pModifiers = (TransitionModifierInterface**)nlMalloc(m_nModifiers * sizeof(TransitionModifierInterface*), 8, 0);
    memcpy(m_pModifiers, pModifiers, m_nModifiers * sizeof(TransitionModifierInterface*));
}

/**
 * Offset/Address/Size: 0x0 | 0x8020692C | size: 0x3B8
 */
TransitionModifierInterface* ScriptedScreenTransition::GetModifierFromName(char* pName)
{
    if (nlStrCmp<char>(pName, "modelscale") == 0)
    {
        return new (nlMalloc(0x14, 8, false)) TransitionModifiers::ScaleModel();
    }

    if (nlStrCmp<char>(pName, "colour") == 0)
    {
        return new (nlMalloc(0xC, 8, false)) TransitionModifiers::ColourBlend();
    }

    if (nlStrCmp<char>(pName, "texturescale") == 0)
    {
        return new (nlMalloc(0x14, 8, false)) TransitionModifiers::ScaleTexture();
    }

    if (nlStrCmp<char>(pName, "modelshift") == 0)
    {
        return new (nlMalloc(0x14, 8, false)) TransitionModifiers::TranslateModel();
    }

    if (nlStrCmp<char>(pName, "textureshift") == 0)
    {
        return new (nlMalloc(0x14, 8, false)) TransitionModifiers::TranslateTexture();
    }
    if (nlStrCmp<char>(pName, "modelrotate") == 0)
    {
        return new (nlMalloc(0x18, 8, false)) TransitionModifiers::RotateModel();
    }

    if (nlStrCmp<char>(pName, "texturerotate") == 0)
    {
        return new (nlMalloc(0x18, 8, false)) TransitionModifiers::RotateTexture();
    }

    if (nlStrCmp<char>(pName, "screenblur") == 0)
    {
        return new (nlMalloc(0xC, 8, false)) TransitionModifiers::ScreenBlur();
    }

    if (nlStrCmp<char>(pName, "screengrab") == 0)
    {
        return new (nlMalloc(0xC, 8, false)) TransitionModifiers::ScreenGrab();
    }
    return NULL;
}
